      ******************************************************************
      * Author: RAISSA CARNEIRO
      * Date: 01-12-22
      * Purpose: EXEMPLO DO USO DO COMANDO DISPLAY - CURSO APRENDA COBOL
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DISPLAY.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY 'ESSA FRASE SO PODE SER VISUALIZADA PORQUE ESTOU'
            ' USANDO O COMANDO DISPLAY'
            STOP RUN.
