      ******************************************************************
      * Author: RAISSA CARNEIRO
      * Date: 09/11/2022
      * Purpose: MOSTRAR UM HELLO HI
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "HELLO HI"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
